ЛИС2/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <comment>В справочнике содержатся сведения о договорах с контрагентами.</comment>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СПролонгацией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойДоговор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговораКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОплатыКонтрагентом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОплатыКонтрагентом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПлатыЗаНВнаОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатаЗаНВнаОСПоСписку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередачаОтходовСПереходомПраваСобственности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорОКонечномРазмещенииОтходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>CatalogRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДоговора</name>
    <type>
      <types>CatalogRef.СтатусыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Доходный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаЛицензии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерЛицензии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ЛИС2/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	УправлениеВидимостью(ЭтаФорма);
	
	
	ЭтаФорма.Элементы.GUID.Видимость = Ложь;
	ЭтаФорма.Элементы.ДекорацияДляСдвигаВнизПролонгации.Видимость = Истина;

	Элементы.GUID.ТолькоПросмотр = Не РольДоступна("ПолныеПрава");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПериодДоговора.ДатаНачала = Объект.СрокДействияС;
	ПериодДоговора.ДатаОкончания = Объект.СрокДействияПо;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	
	Объект.Наименование = Объект.НомерДоговора;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПлатыЗаНВнаОСПриИзменении(Элемент)
	
	УправлениеВидимостью(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДоговораПриИзменении(Элемент)
	
	Объект.СрокДействияС = ПериодДоговора.ДатаНачала;
	Объект.СрокДействияПо = ПериодДоговора.ДатаОкончания;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементыФормы.ДатаНачалаОплатыКонтрагентом.Видимость 	= (Форма.Объект.ДоговорПлатыЗаНВнаОС = Истина);
	ЭлементыФормы.ДатаОкончанияОплатыКонтрагентом.Видимость = (Форма.Объект.ДоговорПлатыЗаНВнаОС = Истина);
	
	Если Форма.Объект.ДоговорПлатыЗаНВнаОС = Ложь Тогда
		Форма.Объект.ДатаНачалаОплатыКонтрагентом 			= Неопределено;
		Форма.Объект.ДатаОкончанияОплатыКонтрагентом 		= Неопределено;
	КонецЕсли;
	
	ЭлементыФормы.ПлатаЗаНВнаОСПоСписку.Видимость 			= (Форма.Объект.ДоговорПлатыЗаНВнаОС = Истина);

	
КонецПроцедуры

&НаКлиенте
Процедура ПлатаЗаНВнаОСПоСпискуПриИзменении(Элемент)
	
	УправлениеВидимостью(ЭтаФорма);	
			
КонецПроцедуры

#КонецОбласти
